var time2 = performance.now(); // засекаем время работы в микросекундах 
let Arr2 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
 11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
 21, 22, 23, 24, 25, 26, 27, 28, 29, 30,
 31, 32, 33, 34, 35, 36, 37, 38, 39, 40,
 41, 42, 43, 44, 45, 46, 47, 48, 49, 50,
 51, 52, 53, 54, 55, 56, 57, 58, 59, 60,
 61, 62, 63, 64, 65, 66, 67, 68, 69, 70,
 71, 72, 73, 74, 75, 76, 77, 78, 79, 80,
 81, 82, 83, 84, 85, 86, 87, 88, 89, 90,
 91, 92, 93, 94, 95, 96, 97, 98, 99, 100,
 101, 102, 103, 104, 105, 106, 107, 108, 109, 110,
 111, 112, 113, 114, 115, 116, 117, 118, 119, 120,
 121, 122, 123, 124, 125, 126, 127, 128];
let n2 = null;

function binarySearch(Arr2, n2) {
	let k;
	for (let i = 0, j = Arr2.length-1; i <= j;) {
		k = Math.floor((i + j) / 2);
		console.log('k_number = ' + Arr2[k]);
		if (n2 === Arr2[k]) 
			return k;
		else if (n2 < Arr2[k]) 
			j = k - 1; // много
			else 
				i = k + 1; // мало
	}
	return -1;
}


n2 = 128;
console.log('---------------');
console.log('selected_number = ' + n2);
console.log('index_number = ' + binarySearch(Arr2, n2));

time2 = performance.now() - time2; // вычисляем общее время работы скрипта
time2 = time2 / 1000; // переводим время в миллисекунды
console.log('Время выполнения = ', time2.toFixed(5) + ' миллисекунд');